<?php

$config = array_merge($config, [
    'current_survey' => 1,
    'survey' => [
        //第一个调查问卷
        [
            'title' => '李氏砭法——虎符铜砭刮痧疗愈传授班',
            'header' => '感谢您参加李氏砭法——虎符铜砭刮痧疗愈传授班，为进一步了解您本次培训学习效果和对我们的服务满意度，请您花几分钟时间配合做好这次调查问卷。（部分可多选）',
            'questions' => [
                [
                    'question' => '您参加本次学习是为了?',
                    'answer' => [
                        'a' => '可以帮助自己和家人治疗家庭常见疾病',
                        'b' => '职业需要',
                        'c' => '对刮痧课程比较感兴趣，想进一步学习',
                        'd' => '其他'
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '本次培训内容?',
                    'answer' => [
                        'a' => '容易接受',
                        'b' => '接合实际，便于应用',
                        'c' => '深度适中，易于理解',
                        'd' => '有点难度，难掌握'
                    ],
                    'type' => 'checkbox'
                ],
                [
                    'question' => '本次培训，主讲老师?',
                    'answer' => [
                        'a' => '准备充分，时间安排合理',
                        'b' => '培训内容有独特精辟见解',
                        'c' => '生动多样，能使学员很快掌握',
                        'd' => '对授课现场与气氛有所把握'
                    ],
                    'type' => 'checkbox'
                ],
                [
                    'question' => '您觉得本次课程的时间安排?',
                    'answer' => [
                        'a' => '合理',
                        'b' => '紧凑',
                        'c' => '不合理',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您对本次培训学习教务人员的服务?',
                    'answer' => [
                        'a' => '满意',
                        'b' => '不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '近期开设中医课程，您感兴趣的有哪些?',
                    'answer' => [
                        'a' => '4月21日—23日 《中医诊断学》 无锡',
                        'b' => '5月5日—7日 《家庭灸》 无锡',
                        'c' => '5月20日—22日 《经络腧穴学》 无锡',
                        'd' => '6月30—7月2日 《颊针课程》 上海',
                        'e' => '《小儿推拿班》',
                        'f' => '《家庭艾灸系列》',
                        'g' => '《腹针疗法》',
                        'h' => '《一指禅推拿》',
                        'i' => '《中医五运六气系列》',
                        'j' => '《伤寒论》',
                    ],
                    'type' => 'checkbox'
                ],
                [
                    'question' => '通过本次学习，您有哪些收获？您对此次培训课程有何建议或需要进改进的地方?',
                    'answer' => [
                    ],
                    'type' => 'text'
                ],
            ]
        ],//第一个调查问卷结束
        [
            'title' => '颊针精品一级班',
            'header' => '感谢您参加颊针精品一级班的课程！<br/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;为了解您的课后感受，进一步做好今后的培训工作，特进行此次问卷调查，以便根据您的意见与建议，更加合理、更有针对性地设计、改进课程，满足您的培训需求。希望您能够认真填写问卷。感谢您的大力支持！<br/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;请根据您的实际情况认真选择，在您的选项上勾选出来。
',
            'questions' => [
                [
                    'question' => '您认为本次课程目标的明确性?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为培训内容的实用性?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您对课程难易程度的认可度?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为培训内容满足您需求的程度?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为讲师的专业能力及授课技巧?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为讲师和学员互动沟通能力?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为助教专业能力?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '组织方课程安排是否合理?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '课程信息发布宣传和课后跟进的到位程度?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为培训效果与您的预期相比?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您对颊针疗法第二阶段课程的兴趣?',
                    'answer' => [
                        'a' => '非常有兴趣',
                        'b' => '比较有兴趣',
                        'c' => '还可以',
                        'd' => '需要考虑',
                        'e' => '不考虑',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您是否愿意向身边人介绍颊针疗法?',
                    'answer' => [
                        'a' => '非常愿意',
                        'b' => '比较愿意',
                        'c' => '基本愿意',
                        'd' => '不太愿意',
                        'e' => '不愿意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '你从哪个途径了解到的培训信息？',
                    'answer' => [
                        'a' => '熟人介绍',
                        'b' => '微信公众平台、朋友圈',
                        'c' => '其他网站、论坛',
                        'd' => '杂志、报纸等纸质媒体',
                        'e' => '其他',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您对于课程内容方面的有何具体建议；您对于讲师及助教教授课程方面有何建议；您对于组织方培训安排的有何具体建议；您希望下次获得哪方面的课程和培训?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'text'
                ],
            ]
        ],
        [
            'title' => '李氏砭法-培训效果调查',
            'header' => '感谢您参加李氏砭法虎符铜砭刮痧疗愈传授班课程！<br/>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;为了解您的课后感受，进一步做好今后的培训工作，特进行此次问卷调查，以便根据您的意见与建议，更加合理、更有针对性地设计、改进课程，满足您的培训需求。希望您能够认真填写问卷。感谢您的大力支持！',
            'questions' => [
                [
                    'question' => '您认为本次课程目标的明确性?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为培训内容的实用性?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为课程的难易程度?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为培训内容满足您需求的程度?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为讲师的专业能力及授课技巧?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为讲师和学员互动沟通能力?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为助教专业能力?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '组织方课程安排是否合理?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '课程信息发布宣传和课后跟进的到位程度?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您认为培训效果与您的预期相比?',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您是否愿意向身边人介绍李氏砭法?',
                    'answer' => [
                        'a' => '非常愿意',
                        'b' => '比较愿意',
                        'c' => '基本愿意',
                        'd' => '不太愿意',
                        'e' => '不愿意',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您从哪个途径了解到的培训信息?',
                    'answer' => [
                        'a' => '熟人介绍',
                        'b' => '微信公众平台、朋友圈',
                        'c' => '其他网站、论坛',
                        'd' => '杂志、报纸等纸质媒体',
                        'e' => '其他',
                    ],
                    'type' => 'radio'
                ],
                [
                    'question' => '您对于课程内容方面的有何具体建议；您对于讲师及助教教授课程方面有何建议；您对于组织方培训安排的有何具体建议；您希望下次获得哪方面的课程和培训？',
                    'answer' => [
                        'a' => '非常好，非常满意',
                        'b' => '比较好，比较满意',
                        'c' => '还可以',
                        'd' => '不太好，不太满意',
                        'e' => '非常不好，非常不满意',
                    ],
                    'type' => 'text'
                ],
            ],
        ],
    ]
]);